examples/templates/cylinder2D_salehi/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  9
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// One episode: 400 control steps of 0.4.

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         160;

deltaT          0.01;

writeControl    runTime;

writeInterval   160;

purgeWrite      2;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

libs            ("libuqtopusPolicy.so");

functions
{
    #include "funcObjForces"
    // #include "funcObjProbes"
}

// ************************************************************************* //
