examples/templates/cylinder2D_salehi/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  9
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector>
7180
(
(6.864362057e-05 -0.002034764725 -3.094315371e-19)
(-4.753423248e-05 -0.006537683998 -5.575967926e-19)
(-0.0005958733795 -0.01185464482 1.456695709e-18)
(-0.001734677026 -0.01809036748 -5.577573131e-19)
(-0.003590402194 -0.02533575182 1.500861857e-20)
(-0.006313951703 -0.03365853091 -2.560085664e-20)
(-0.01007555524 -0.04308700547 -7.014064426e-21)
(-0.01505342359 -0.05359200993 -1.164091484e-19)
...
);

boundaryField
{
    cylinder
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    jet
    {
    {{ controller | indent(4) }}
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform ( 1 0 0 );
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
        value           nonuniform List<vector>
60
(
(0.993948695 -0.003424081045 -1.879731646e-21)
(0.9929775087 -0.003161904278 -1.520935023e-21)
(0.9911121935 -0.002896144565 -2.478290081e-22)
(0.9884278669 -0.002630210037 2.497429381e-23)
(0.9850291937 -0.002367119767 3.623865999e-23)
(0.9810431583 -0.002111316103 1.515774987e-22)
(0.9766115031 -0.0018590126 1.65976246e-21)
(0.9723015656 -0.001631635241 -1.468840037e-21)
...
);
    }
    topAndBottom
    {
        type            fixedValue;
        value           uniform ( 1 0 0 );
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
