examples/templates/cylinder2D_salehi/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  9
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         DICGaussSeidel;
        tolerance        1e-05;
        relTol           0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "pcorr.*"
    {
        $p
        tolerance       0.01;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    "cell.*"
    {
        solver          GAMG;
        tolerance       1e-16;
        relTol          0;
        smoother        GaussSeidel;
        maxIter         100;
    }

}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    15;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    consistent          yes;

    outerCorrectorResidualControl
    {
        "(U|p)"
        {
            relTol          0;
            tolerance       1e-04;
        }
    }
}

// ************************************************************************* //
