examples/templates/cylinder2D_salehi/system/funcObjProbes

probes
{
    type            probes;
    libs            ("libsampling.so");
    writeControl    timeStep;
    writeInterval   1;
    fixedLocations  true;
    interpolationScheme cellPoint;
    fields          (p);
    probeLocations
    (
        #include "probes"
    );
}
