examples/templates/cylinder2D_salehi/system/probes
( 0.550000 -1.250000 0 )
( 0.550000 -0.937500 0 )
( 0.550000 -0.625000 0 )
( 0.550000 -0.312500 0 )
( 0.550000 0.000000 0 )
( 0.550000 0.312500 0 )
( 0.550000 0.625000 0 )
( 0.550000 0.937500 0 )
( 0.550000 1.250000 0 )
( 1.295000 -1.250000 0 )
( 1.295000 -0.937500 0 )
( 1.295000 -0.625000 0 )
( 1.295000 -0.312500 0 )
( 1.295000 0.000000 0 )
( 1.295000 0.312500 0 )
( 1.295000 0.625000 0 )
( 1.295000 0.937500 0 )
( 1.295000 1.250000 0 )
( 2.040000 -1.250000 0 )
( 2.040000 -0.937500 0 )
( 2.040000 -0.625000 0 )
( 2.040000 -0.312500 0 )
( 2.040000 0.000000 0 )
( 2.040000 0.312500 0 )
( 2.040000 0.625000 0 )
( 2.040000 0.937500 0 )
( 2.040000 1.250000 0 )
( 2.785000 -1.250000 0 )
( 2.785000 -0.937500 0 )
( 2.785000 -0.625000 0 )
( 2.785000 -0.312500 0 )
( 2.785000 0.000000 0 )
( 2.785000 0.312500 0 )
( 2.785000 0.625000 0 )
( 2.785000 0.937500 0 )
( 2.785000 1.250000 0 )
( 3.530000 -1.250000 0 )
( 3.530000 -0.937500 0 )
( 3.530000 -0.625000 0 )
( 3.530000 -0.312500 0 )
( 3.530000 0.000000 0 )
( 3.530000 0.312500 0 )
( 3.530000 0.625000 0 )
( 3.530000 0.937500 0 )
( 3.530000 1.250000 0 )
( 4.275000 -1.250000 0 )
( 4.275000 -0.937500 0 )
( 4.275000 -0.625000 0 )
( 4.275000 -0.312500 0 )
( 4.275000 0.000000 0 )
( 4.275000 0.312500 0 )
( 4.275000 0.625000 0 )
( 4.275000 0.937500 0 )
( 4.275000 1.250000 0 )
( 5.020000 -1.250000 0 )
( 5.020000 -0.937500 0 )
( 5.020000 -0.625000 0 )
( 5.020000 -0.312500 0 )
( 5.020000 0.000000 0 )
( 5.020000 0.312500 0 )
( 5.020000 0.625000 0 )
( 5.020000 0.937500 0 )
( 5.020000 1.250000 0 )
( 5.765000 -1.250000 0 )
( 5.765000 -0.937500 0 )
( 5.765000 -0.625000 0 )
( 5.765000 -0.312500 0 )
( 5.765000 0.000000 0 )
( 5.765000 0.312500 0 )
( 5.765000 0.625000 0 )
( 5.765000 0.937500 0 )
( 5.765000 1.250000 0 )
( 6.510000 -1.250000 0 )
( 6.510000 -0.937500 0 )
( 6.510000 -0.625000 0 )
( 6.510000 -0.312500 0 )
( 6.510000 0.000000 0 )
( 6.510000 0.312500 0 )
( 6.510000 0.625000 0 )
( 6.510000 0.937500 0 )
( 6.510000 1.250000 0 )
( 7.255000 -1.250000 0 )
( 7.255000 -0.937500 0 )
( 7.255000 -0.625000 0 )
( 7.255000 -0.312500 0 )
( 7.255000 0.000000 0 )
( 7.255000 0.312500 0 )
( 7.255000 0.625000 0 )
( 7.255000 0.937500 0 )
( 7.255000 1.250000 0 )
( 8.000000 -1.250000 0 )
( 8.000000 -0.937500 0 )
( 8.000000 -0.625000 0 )
( 8.000000 -0.312500 0 )
( 8.000000 0.000000 0 )
( 8.000000 0.312500 0 )
( 8.000000 0.625000 0 )
( 8.000000 0.937500 0 )
( 8.000000 1.250000 0 )
